STMicroelectronics/stm32ai-modelzoo/image_classification/getting_started/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_filtering.c
/**
 ******************************************************************************
 * @file   stm32ipl_filtering.c
 * @author SRA AI Application Team
 * @brief  STM32 Image Processing Library - filtering module
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "stm32ipl.h"
#include "stm32ipl_imlib_int.h"

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief Applies a standard mean blurring filter using a box filter to an image.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param threshold True enables adaptive thresholding of the image, which sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param offset	Negative value sets more pixels to 1 as you make it more negative, while a
 * positive value only sets the sharpest contrast changes to 1.
 * @param invert	True inverts the binary image resulting output.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_MeanFilter(image_t *img, uint8_t kSize, bool threshold, int32_t offset, bool invert,
		const image_t *mask)
{
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	imlib_mean_filter(img, kSize, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Applies a standard mean blurring filter using a box filter to an image.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		 Image; if it is not valid, an error is returned.
 * @param kSize		 Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param percentile [0, 1] value; it controls the percentile of the value used in the kernel. By default each
 * pixel is replaced with the 50th percentile (center) of its neighbors. You can set this to 0 for a
 * min filter, 0.25 for a lower quartile filter, 0.75 for an upper quartile filter, and 1.0 for a max filter.
 * @param threshold  True enables adaptive thresholding of the image, which sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param offset	 Negative value sets more pixels to 1 as you make it more negative, while a
 * positive value only sets the sharpest contrast changes to 1.
 * @param invert	 True inverts the binary image resulting output.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			 stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_MedianFilter(image_t *img, uint8_t kSize, float percentile, bool threshold, int32_t offset,
		bool invert, const image_t *mask)
{
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	if ((percentile < 0.0f) || (percentile > 1.0f))
		return stm32ipl_err_InvalidParameter;

	imlib_median_filter(img, kSize, percentile, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Runs the mode filter on the image by replacing each pixel with the mode of their neighbours.
 * This method works great on grayscale images. However, on RGB images it creates a lot of artifacts
 * on edges because of the non-linear nature of the operation.
 * The supported formats are Binary, Grayscale, RGB565B, RGB888.
 * @param img 		Image; if it is not valid, an error is returned.
 * @param kSize 	Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), etc.
 * @param threshold True enables adaptive thresholding of the image, which sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param offset	Negative value sets more pixels to 1 as you make it more negative, while a
 * positive value only sets the sharpest contrast changes to 1.
 * @param invert 	True sets the binary image resulting output.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_ModeFilter(image_t *img, uint8_t kSize, bool threshold, int32_t offset, bool invert,
		const image_t *mask)
{
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

