STMicroelectronics/stm32ai-modelzoo/image_classification/getting_started/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_filtering.c
	imlib_mode_filter(img, kSize, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Runs the midpoint filter on the image. This filter finds the midpoint
 * ((max-min)/2) of each pixel neighborhood in the image.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img 		Image; if it is not valid, an error is returned.
 * @param kSize 	Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), etc.
 * @param bias 		[0, 1] value; it controls the min/max mixing; 0 for min filtering only, 1.0 for max filtering only.
 * @param threshold True enables adaptive thresholding of the image which sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param offset  	If threshold is true and offset set to a negative value, sets more pixels to 1
 * as you make it more negative, while a positive value only sets the sharpest contrast changes to 1.
 * @param invert 	If threshold is true and invert is true the binary image resulting output is inverted.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_MidpointFilter(image_t *img, uint8_t kSize, float bias, bool threshold, int32_t offset,
bool invert, const image_t *mask)
{
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	if ((bias < 0.0f) || (bias > 1.0f))
		return stm32ipl_err_InvalidParameter;

	imlib_midpoint_filter(img, kSize, bias, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves an image by a bilateral filter. The bilateral filter smooth the image
 * while keeping edges in the image.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img 			Image; if it is not valid, an error is returned.
 * @param kSize			Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), etc.
 * @param colorSigma 	Controls how closely colors are matched using the bilateral filter.
 * Increase this to increase color blurring.
 * @param spaceSigma 	Controls how closely pixels space-wise are blurred with each other.
 * Increase this to increase pixel blurring.
 * @param threshold 	True enables adaptive thresholding of the image, which sets pixels
 * to one or zero based on a pixel’s brightness in relation to the brightness of the kernel
 * of pixels around them.
 * @param offset  		If threshold is true and offset set to a negative value, sets more
 * pixels to 1 as you make it more negative, while a positive value only sets the sharpest
 * contrast changes to 1.
 * @param invert 		If threshold is true and invert is true the binary image resulting
 * output is inverted.
 * @param mask 			Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return				stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_BilateralFilter(image_t *img, uint8_t kSize, float colorSigma, float spaceSigma, bool threshold,
		int32_t offset, bool invert, const image_t *mask)
{
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	imlib_bilateral_filter((image_t*)img, kSize, colorSigma, spaceSigma, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves the image by krn kernel.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param krn		Kernel data.
 * @param mul		Number to multiply the convolution pixel results by. If 0, the value that will prevent
 * scaling in the convolution output. Basically allows you to do a global contrast adjustment. Pixels
 * that go outside of the image mins and maxes for color channels will be clipped.
 * @param add		Value to add to each convolution pixel result. Basically allows you to do a global
 * brightness adjustment. Pixels that go outside of the image mins and maxes for color channels will be clipped.
 * @param threshold If true, the adaptive thresholding of the image is enabled and sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param offset	Negative offset value sets more pixels to 1 as you make it more negative, while a positive
 * value only sets the sharpest contrast changes to 1.
 * @param invert	True inverts the binary image resulting output.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return	stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_Morph(image_t *img, uint8_t kSize, const int32_t *krn, float mul, int32_t add, bool threshold,
		int32_t offset, bool invert, const image_t *mask)
{
	int n;
	int m;

	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	n = kSize * 2 + 1;
	m = 0;

	for (int i = 0; i < n * n; i++) {
		m += krn[i];
	}

	if (m == 0) {
		m = 1;
	}
	if (mul == 0)
		mul = 1.0f / m;

	imlib_morph(img, kSize, (int*)krn, mul, add, threshold, offset, invert, (image_t*)mask);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves the image by a smoothing gaussian kernel.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param threshold	True enables adaptive thresholding of the image, which sets pixels to one or zero
 * based on a pixel’s brightness in relation to the brightness of the kernel of pixels around them.
 * @param unsharp	True improves image sharpness on edges.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_Gaussian(image_t *img, uint8_t kSize, bool threshold, bool unsharp, const image_t *mask)
{
	int k_2;
	int n;
	int *pascal;
	int *krn;
	int m;

