STMicroelectronics/stm32ai-modelzoo/image_classification/getting_started/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_filtering.c
	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	k_2 = kSize * 2;
	n = k_2 + 1;

	pascal = xalloc0(n * sizeof(int));
	if (!pascal)
		return stm32ipl_err_OutOfMemory;

	pascal[0] = 1;

	for (int i = 0; i < k_2; i++) {
		/* Compute a row of pascal's triangle. */
		pascal[i + 1] = (pascal[i] * (k_2 - i)) / (i + 1);
	}

	krn = xalloc0(n * n * sizeof(int));
	if (!krn) {
		xfree(pascal);
		return stm32ipl_err_OutOfMemory;
	}

	m = 0;

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			int temp = pascal[i] * pascal[j];
			krn[(i * n) + j] = temp;
			m += temp;
		}
	}

	xfree(pascal);

	if (unsharp) {
		krn[((n / 2) * n) + (n / 2)] -= m * 2;
		m = -m;
	}

	imlib_morph(img, kSize, krn, 1.0f / m, 0, threshold, 0, false, (image_t*)mask);

	xfree(krn);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves the image by a edge detecting laplacian kernel.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param sharpen	If true, this method will instead sharpen the image. Increase the kernel size
 * then to increase the image sharpness.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return			stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_Laplacian(image_t *img, uint8_t kSize, bool sharpen, const image_t *mask)
{
	int k_2;
	int n;
	int *pascal;
	int *krn;
	int m;

	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	k_2 = kSize * 2;
	n = k_2 + 1;

	pascal = xalloc0(n * sizeof(int));
	if (!pascal)
		return stm32ipl_err_OutOfMemory;

	pascal[0] = 1;

	for (int i = 0; i < k_2; i++) {
		/* Compute a row of pascal's triangle. */
		pascal[i + 1] = (pascal[i] * (k_2 - i)) / (i + 1);
	}

	krn = xalloc0(n * n * sizeof(int));
	if (!krn) {
		xfree(pascal);
		return stm32ipl_err_OutOfMemory;
	}

	m = 0;

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			int temp = pascal[i] * pascal[j];
			krn[(i * n) + j] = -temp;
			m += temp;
		}
	}

	xfree(pascal);

	krn[((n / 2) * n) + (n / 2)] += m;
	m = krn[((n / 2) * n) + (n / 2)];

	if (sharpen) {
		krn[((n / 2) * n) + (n / 2)] += m;
	}

	imlib_morph(img, kSize, krn, 1.0f / m, 0, false, 0, false, (image_t*)mask);

	xfree(krn);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves the image by a edge detecting Sobel kernel.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; use 1 (3x3 kernel), 2 (5x5 kernel), ..., n (((n*2)+1)x((n*2)+1) kernel).
 * @param sharpen	If true, this method will instead sharpen the image. Increase the kernel size
 * then to increase the image sharpness.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return		stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_Sobel(image_t *img, uint8_t kSize, bool sharpen, const image_t *mask)
{
	int k_2;
	int n;
	int *pascal;
	int *krn;
	int m;
	float mul;
	image_t sobel_x;
	image_t sobel_y;

	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	k_2 = kSize * 2;
	n = k_2 + 1;

	pascal = xalloc(n * sizeof(int));
	if (!pascal) {
		return stm32ipl_err_OutOfMemory;
	}
	pascal[0] = 1;

	for (int i = 0; i < k_2; i++) {
		/* Compute a row of pascal's triangle. */
		pascal[i + 1] = (pascal[i] * (k_2 - i)) / (i + 1);
	}

	krn = xalloc(n * n * sizeof(int));
	if (!krn) {
		xfree(pascal);
		return stm32ipl_err_OutOfMemory;
	}

	m = 0;

	for (int i = 0; i < n; i++) {
		if (i < (n - 1) / 2) {
			for (int j = 0; j < n; j++) {
				int temp = pascal[i] * pascal[j];
				krn[(i * n) + j] = -temp;
				m += temp;
			}
		} else
			if (i > (n - 1) / 2) {
				for (int j = 0; j < n; j++) {
					int temp = pascal[i] * pascal[j];
					krn[(i * n) + j] = temp;
					m += temp;
				}

			} else
				if (i == (n - 1) / 2) {
					for (int j = 0; j < n; j++) {
						krn[(i * n) + j] = 0;
					}
				}
	}

	if (sharpen) {
		krn[((n / 2) * n) + (n / 2)] += m / 2;
	}

	mul = 1.0f / m;

	sobel_x.data = xalloc(STM32Ipl_ImageDataSize(img));
	if (!sobel_x.data) {
		xfree(pascal);
		xfree(krn);
		return stm32ipl_err_OutOfMemory;
	}

	STM32Ipl_Init(&sobel_x, img->w, img->h, (image_bpp_t)img->bpp, (void*)sobel_x.data);

	sobel_y.data = xalloc(STM32Ipl_ImageDataSize(img));
	if (!sobel_y.data) {
		xfree(pascal);
		xfree(krn);
		xfree(sobel_x.data);
		return stm32ipl_err_OutOfMemory;
	}

	STM32Ipl_Init(&sobel_y, img->w, img->h, (image_bpp_t)img->bpp, (void*)sobel_y.data);

	memcpy(sobel_x.data, img->data, STM32Ipl_ImageDataSize(img));
	memcpy(sobel_y.data, img->data, STM32Ipl_ImageDataSize(img));

	imlib_morph(&sobel_x, kSize, krn, mul, 0, false, 0, false, (image_t*)mask);

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			int temp = pascal[i] * pascal[j];
			if (j < (n - 1) / 2)
				krn[(i * n) + j] = -temp;
			else
				if (j > (n - 1) / 2)
					krn[(i * n) + j] = temp;
				else
					krn[(i * n) + j] = 0;
		}
	}

	if (sharpen) {
		krn[((n / 2) * n) + (n / 2)] += m % 2 ? m / 2 : (m / 2) + 1;
	}

	imlib_morph(&sobel_y, kSize, krn, mul, 0, false, 0, false, (image_t*)mask);

	STM32Ipl_Add(&sobel_x, &sobel_y, 1, NULL);

	xfree(img->data);
	STM32Ipl_Init(img, img->w, img->h, (image_bpp_t)sobel_x.bpp, (void*)sobel_x.data);

