STMicroelectronics/stm32ai-modelzoo/image_classification/getting_started/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_filtering.c
	xfree(sobel_y.data);
	xfree(pascal);
	xfree(krn);

	return stm32ipl_err_Ok;
}

/**
 * @brief Convolves the image by a edge detecting Scharr kernel.
 * The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param img		Image; if it is not valid, an error is returned.
 * @param kSize		Kernel size; currently only kSize = 1 is allowed, corresponding to a 3x3 kernel.
 * @param sharpen	If true, this method will instead sharpen the image. Increase the kernel size
 * then to increase the image sharpness.
 * @param mask 		Optional image to be used as a pixel level mask for the operation.
 * The mask must have the same resolution as the source image. Only the source pixels that
 * have the corresponding mask pixels set are considered.
 * The pointer to the mask can be null: in this case all the source image pixels are considered.
 * @return		stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_Scharr(image_t *img, uint8_t kSize, bool sharpen, const image_t *mask)
{
	int k_2;
	int n;
	int *krn;
	int m;
	float mul;
	image_t scharr_x;
	image_t scharr_y;

	STM32IPL_CHECK_VALID_IMAGE(img)
	STM32IPL_CHECK_FORMAT(img, STM32IPL_IF_ALL)

	if (mask) {
		STM32IPL_CHECK_VALID_IMAGE(mask)
		STM32IPL_CHECK_FORMAT(mask, STM32IPL_IF_ALL)
		STM32IPL_CHECK_SAME_SIZE(img, mask)
	}

	k_2 = kSize * 2;

	if (k_2 != 2)
		return stm32ipl_err_NotImplemented;

	n = k_2 + 1;

	krn = xalloc(n * n * sizeof(int));
	if (krn == NULL) {
		return stm32ipl_err_OutOfMemory;
	}

	krn[0] = -3;
	krn[1] = -10;
	krn[2] = -3;
	krn[3] = 0;
	krn[4] = 0;
	krn[5] = 0;
	krn[6] = 3;
	krn[7] = 10;
	krn[8] = 3;

	m = 32;

	if (sharpen) {
		krn[((n / 2) * n) + (n / 2)] += m % 2 ? m / 2 : (m / 2) + 1;
	}

	mul = 1.0f / m;

	scharr_x.data = xalloc(STM32Ipl_ImageDataSize(img));
	if (!scharr_x.data) {
		xfree(krn);
		return stm32ipl_err_OutOfMemory;
	}
	STM32Ipl_Init(&scharr_x, img->w, img->h, (image_bpp_t)img->bpp, (void*)scharr_x.data);

	scharr_y.data = xalloc(STM32Ipl_ImageDataSize(img));
	if (!scharr_y.data) {
		xfree(krn);
		xfree(scharr_x.data);
		return stm32ipl_err_OutOfMemory;
	}
	STM32Ipl_Init(&scharr_y, img->w, img->h, (image_bpp_t)img->bpp, (void*)scharr_y.data);

	memcpy(scharr_x.data, img->data, STM32Ipl_ImageDataSize(img));
	memcpy(scharr_y.data, img->data, STM32Ipl_ImageDataSize(img));

	if (sharpen) {
		krn[((n / 2) * n) + (n / 2)] += m / 2;
	}

	imlib_morph(&scharr_x, kSize, krn, mul, 0, false, 0, false, (image_t*)mask);

	krn[0] = -3;
	krn[1] = 0;
	krn[2] = 3;
	krn[3] = -10;
	krn[4] = 0;
	krn[5] = 10;
	krn[6] = -3;
	krn[7] = 0;
	krn[8] = 3;

	imlib_morph(&scharr_y, kSize, krn, mul, 0, false, 0, false, (image_t*)mask);

	STM32Ipl_Add(&scharr_x, &scharr_y, 1, NULL);

	xfree(img->data);
	STM32Ipl_Init(img, img->w, img->h, (image_bpp_t)scharr_x.bpp, (void*)scharr_x.data);

	xfree(scharr_y.data);
	xfree(krn);

	return stm32ipl_err_Ok;
}

/**
 * @brief Finds the midpoints of xDiv * yDiv kernels in the source image and stores them in
 * the destination image. The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param src		Source image; if it is not valid, an error is returned.
 * @param dst		Destination image; it must have the same format as the source image;
 * its width and height must be a fraction of source image (dstW = srcW / xDiv) and (dstH = srcH / yDiv),
 *  otherwise an error is returned; if it is not valid, an error is returned.
 * @param xDiv 		Width of the kernel.
 * @param yDiv		Height of the kernel.
 * @param bias		A bias of 0 returns the min of each area while a bias of 256 returns the max of each area.
 * @return		stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_MidpointPool(const image_t *src, image_t *dst, uint16_t xDiv, uint16_t yDiv, uint16_t bias)
{
	STM32IPL_CHECK_VALID_IMAGE(src)
	STM32IPL_CHECK_VALID_IMAGE(dst)
	STM32IPL_CHECK_FORMAT(src, STM32IPL_IF_ALL)
	STM32IPL_CHECK_SAME_FORMAT(src, dst)

	if ((src == dst))
		return stm32ipl_err_InvalidParameter;

	if (((src->w / xDiv) != dst->w) || ((src->h / yDiv) != dst->h))
		return stm32ipl_err_InvalidParameter;

	if (bias > 256)
		return stm32ipl_err_InvalidParameter;

	imlib_midpoint_pool((image_t*)src, dst, xDiv, yDiv, bias);

	return stm32ipl_err_Ok;
}

/**
 * @brief Finds the mean of xDiv * yDiv kernels in the source image and stores them in
 * the destination image. The supported formats are Binary, Grayscale, RGB565, RGB888.
 * @param src		Source image; if it is not valid, an error is returned.
 * @param dst		Destination image; if it is not valid, an error is returned;
 * it must have the same format as the source image; its width and height must be a
 * fraction of source image (dstW = srcW / xDiv) and (dstH = srcH / yDiv),
 * otherwise an error is returned.
 * @param xDiv 		Width of the kernel.
 * @param yDiv		Height of the kernel.
 * @return		stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_MeanPool(const image_t *src, image_t *dst, uint16_t xDiv, uint16_t yDiv)
{
	STM32IPL_CHECK_VALID_IMAGE(src)
	STM32IPL_CHECK_VALID_IMAGE(dst)
	STM32IPL_CHECK_FORMAT(src, STM32IPL_IF_ALL)
	STM32IPL_CHECK_SAME_FORMAT(src, dst)

	if ((src == dst))
		return stm32ipl_err_InvalidParameter;

	if (((src->w / xDiv) != dst->w) || ((src->h / yDiv) != dst->h))
		return stm32ipl_err_InvalidParameter;

	imlib_mean_pool((image_t*)src, dst, xDiv, yDiv);

	return stm32ipl_err_Ok;
}

#ifdef __cplusplus
}
#endif
